<template>
<section class="cityes my-8">
  <div class="container mx-auto p-1">
    <div class="w-full h-auto">
      <div  class="flex flex-row items-center w-full justify-between sm:grid sm:grid-cols-6 md:grid md:grid-cols-6 lg:flex lg:flex-row lg:items-center lg:w-full lg:justify-between xl:flex xl:flex-row xl:items-center xl:justify-between 2xl:flex 2xl:flex-row 2xl:items-center 2xl:justify-between">
        <div v-for="city in listCity" :key="city.id" class="flex flex-col">
         <div v-for="value in city">
           <p class="text-slate-400 text-[11px] my-1">{{value}}</p>
         </div>
        </div>
      </div>
    </div>
  </div>
</section>
</template>

<script setup>
const listCity=reactive({
      f:['تهران', 'قم', 'اردبیل', 'رودبار', 'ساری', 'کاهشهر', 'البرز', 'کرج', 'خوزشتان', 'بندرعباس'],
      s:['یاسوج', 'مشهد', 'شیراز', 'زنجان', 'اصفهان', 'مراغه', 'تبریز', 'ارومیه', 'کردستان', 'یزد'],
      t:['یاسوج', 'مشهد', 'شیراز', 'زنجان', 'اصفهان', 'مراغه', 'تبریز', 'ارومیه', 'کردستان', 'یزد'],
      fo:['تهران', 'قم', 'اردبیل', 'رودبار', 'ساری', 'کاهشهر', 'البرز', 'کرج', 'خوزشتان', 'بندرعباس'],
      fi:['یاسوج', 'مشهد', 'شیراز', 'زنجان', 'اصفهان', 'مراغه', 'تبریز', 'ارومیه', 'کردستان', 'یزد'],
      si:['یاسوج', 'مشهد', 'شیراز', 'زنجان', 'اصفهان', 'مراغه', 'تبریز', 'ارومیه', 'کردستان', 'یزد'],
      se:['یاسوج', 'مشهد', 'شیراز', 'زنجان', 'اصفهان', 'مراغه', 'تبریز', 'ارومیه', 'کردستان', 'یزد'],
      e:['یاسوج', 'مشهد', 'شیراز', 'زنجان', 'اصفهان', 'مراغه', 'تبریز', 'ارومیه', 'کردستان', 'یزد'],
      n:['یاسوج', 'مشهد', 'شیراز', 'زنجان', 'اصفهان', 'مراغه', 'تبریز', 'ارومیه', 'کردستان', 'یزد'],
      te:['یاسوج', 'مشهد', 'شیراز', 'زنجان', 'اصفهان', 'مراغه', 'تبریز', 'ارومیه', 'کردستان', 'یزد'],
      el:['یاسوج', 'مشهد', 'شیراز', 'زنجان', 'اصفهان', 'مراغه', 'تبریز', 'ارومیه', 'کردستان', 'یزد'],
      tw:['یاسوج', 'مشهد', 'شیراز', 'زنجان', 'اصفهان', 'مراغه', 'تبریز', 'ارومیه', 'کردستان', 'یزد'],
}
)
</script>

<style scoped>

</style>